Repository: xamarin/visualfsharp
Catalog: vsintegration/ProjectTemplates/ConsoleProject/Template/xlf/AssemblyInfo.fs.*.xlf
Languages: fr, pt_br

# GeneralInfo-Line1
source: General Information about an assembly is controlled through the following
fr: Les informations générales relatives à un assembly dépendent de
pt_br: As informações gerais sobre um assembly são controladas por meio do seguinte

# GeneralInfo-Line2
source: set of attributes. Change these attribute values to modify the information
fr: l'ensemble d'attributs suivant. Changez les valeurs de ces attributs pour modifier les informations
pt_br: conjunto de atributos. Altere estes valores de atributo para modificar as informações

# GeneralInfo-Line3
source: associated with an assembly.
fr: associées à un assembly.
pt_br: associados a um assembly.

# ComVisible-Line1
source: Setting ComVisible to false makes the types in this assembly not visible
fr: L'affectation de la valeur false à ComVisible rend les types invisibles dans cet assembly
pt_br: Definir ComVisible como false oculta os tipos neste assembly

# ComVisible-Line2
source: to COM components. If you need to access a type in this assembly from
fr: aux composants COM. Si vous devez accéder à un type dans cet assembly à partir de
pt_br: para componentes COM. Caso precise acessar um tipo neste assembly a partir de

# ComVisible-Line3
source: COM, set the ComVisible attribute to true on that type.
fr: COM, affectez la valeur true à l'attribut ComVisible sur ce type.
pt_br: COM, defina o atributo ComVisible como true nesse tipo.

# Guid-Line1
source: The following GUID is for the ID of the typelib if this project is exposed to COM
fr: Le GUID suivant est pour l'ID de la typelib si ce projet est exposé à COM
pt_br: O GUID a seguir é para a ID de typelib quando este projeto é exposto a COM

# VersionInfo-Line1
source: Version information for an assembly consists of the following four values:
fr: Les informations de version pour un assembly se composent des quatre valeurs suivantes :
pt_br: As informações da versão de um assembly consistem nos quatro valores a seguir:

source: Major Version
fr: Version principale
pt_br: Versão Principal

source: Minor Version
fr: Version secondaire
pt_br: Versão Secundária

source: Build Number
fr: Numéro de build
pt_br: Número da Versão

source: Revision
fr: Révision
pt_br: Revisão

# VersionInfo-Line2
source: You can specify all the values or you can default the Build and Revision Numbers
fr: Vous pouvez spécifier toutes les valeurs ou indiquer les numéros de build et de révision par défaut
pt_br: É possível especificar todos os valores ou usar como padrão os Números da Versão e da Revisão

# VersionInfo-Line3
source: by using the '*' as shown below:
fr: en utilisant '*', comme indiqué ci-dessous :
pt_br: utilizando o '*' como mostrado abaixo:
