Repository: xamarin/visualfsharp
Catalog: vsintegration/ProjectTemplates/LibraryProject/Template/xlf/AssemblyInfo.fs.*.xlf
Languages: es, it, ja, ko, ru, zh_hans, zh_hant

# GeneralInfo-Line1
source: General Information about an assembly is controlled through the following
es: La información general de un ensamblado se controla mediante el siguiente
it: Le informazioni generali relative a un assembly sono controllate dal seguente
ja: アセンブリに関する一般情報は、以下の属性セットによって
ko: 어셈블리의 일반 정보는 다음 특성 집합을 통해
ru: Общие сведения о сборке можно задать с помощью следующего
zh_hans: 有关程序集的一般信息由以下
zh_hant: 組件的一般資訊是由下列的屬性集控制

# GeneralInfo-Line2
source: set of attributes. Change these attribute values to modify the information
es: conjunto de atributos. Cambie estos valores de atributo para modificar la información
it: set di attributi. Modificare i valori di questi attributi per modificare le informazioni
ja: 制御されます。アセンブリに関連付けられている情報を変更するには、
ko: 제어됩니다. 어셈블리와 관련된 정보를 수정하려면
ru: набора атрибутов. Отредактируйте эти значения атрибутов, чтобы изменить сведения,
zh_hans: 控制。更改这些特性值可修改
zh_hant: 變更這些屬性的值即可修改組件的相關

# GeneralInfo-Line3
source: associated with an assembly.
es: asociada con un ensamblado.
it: associate a un assembly.
ja: これらの属性値を変更します。
ko: 이러한 특성 값을 변경하세요.
ru: связанные с этой сборкой.
zh_hans: 与程序集关联的信息。
zh_hant: 資訊。

# ComVisible-Line1
source: Setting ComVisible to false makes the types in this assembly not visible
es: Si establece ComVisible en false, los tipos de este ensamblado no estarán visibles
it: Se si imposta ComVisible su false, i tipi in questo assembly non saranno visibili
ja: ComVisible を false に設定すると、COM コンポーネントがこのアセンブリ内のその型を認識
ko: ComVisible을 false로 설정하면 이 어셈블리의 형식이 COM 구성 요소에
ru: При установке значения False в атрибуте ComVisible типы в этой сборке становятся невидимыми
zh_hans: 将 ComVisible 设置为 false 将使此程序集中的类型
zh_hant: 將 ComVisible 設定為 false 會使得這個組件中的類型

# ComVisible-Line2
source: to COM components. If you need to access a type in this assembly from
es: para los componentes COM. Si necesita obtener acceso a un tipo de este ensamblado desde
it: ai componenti COM. Se è necessario accedere a un tipo in questo assembly da
ja: できなくなります。COM からこのアセンブリ内の型にアクセスする必要がある場合は、
ko: 표시되지 않습니다. COM에서 이 어셈블리의 형식에 액세스하려면
ru: для COM-компонентов. Если требуется обратиться к типу в этой сборке через
zh_hans: 对 COM 组件不可见。 如果需要从 COM 访问此程序集中的类型，
zh_hant: 對 COM 元件而言為不可見。如果您需要從 COM 存取這個組件中

# ComVisible-Line3
source: COM, set the ComVisible attribute to true on that type.
es: COM, establezca el atributo ComVisible en true en este tipo.
it: COM, impostare su true l'attributo ComVisible per tale tipo.
ja: その型の ComVisible 属性を true に設定します。
ko: 해당 형식에 대해 ComVisible 특성을 true로 설정하세요.
ru: COM, задайте для атрибута ComVisible значение True для этого типа.
zh_hans: 请将此类型的 ComVisible 特性设置为 true。
zh_hant: 的類型，請在該類型上將 ComVisible 屬性設定為 true。

# Guid-Line1
source: The following GUID is for the ID of the typelib if this project is exposed to COM
es: El siguiente GUID sirve como id. de typelib si este proyecto se expone a COM.
it: Se il progetto viene esposto a COM, il seguente GUID verrà utilizzato come ID della libreria dei tipi
ja: このプロジェクトが COM に公開される場合、次の GUID がタイプ ライブラリの ID になります
ko: 이 프로젝트가 COM에 노출되는 경우 다음 GUID는 typelib의 ID를 나타냅니다.
ru: Следующий GUID служит для идентификации библиотеки типов, если этот проект видим для COM
zh_hans: 如果此项目向 COM 公开，则下列 GUID 用于类型库的 ID
zh_hant: 下列 GUID 為專案公開 (Expose) 至 COM 時所要使用的 typelib ID

# VersionInfo-Line1
source: Version information for an assembly consists of the following four values:
es: La información de versión de un ensamblado consta de los cuatro valores siguientes:
it: Le informazioni sulla versione di un assembly sono costituite dai quattro valori seguenti:
ja: アセンブリのバージョン情報は、以下の 4 つの値で構成されます。:
ko: 어셈블리의 버전 정보는 다음 네 가지 값으로 구성됩니다.:
ru: Сведения о версии сборки состоят из следующих четырех значений:
zh_hans: 程序集的版本信息由下列四个值组成:
zh_hant: 組件的版本資訊由下列四個值所組成: :

source: Major Version
es: Versión principal
it: Versione principale
ja: メジャー バージョン
ko: 주 버전
ru: Основной номер версии
zh_hans: 主版本
zh_hant: 主要版本

source: Minor Version
es: Versión secundaria
it: Versione secondaria
ja: マイナー バージョン
ko: 부 버전
ru: Вспомогательная версия
zh_hans: 次版本
zh_hant: 次要版本

source: Build Number
es: Número de compilación
it: Numero di build
ja: ビルド番号
ko: 빌드 번호
ru: Номер сборки
zh_hans: 生成号
zh_hant: 組建編號

source: Revision
es: Revisión
it: Revisione
ja: リビジョン
ko: 수정 버전
ru: Редакция
zh_hans: 修订
zh_hant: 修訂

# VersionInfo-Line2
source: You can specify all the values or you can default the Build and Revision Numbers
es: Puede especificar todos los valores o usar los valores predeterminados de número de compilación y de revisión
it: È possibile specificare tutti i valori oppure impostare valori predefiniti per i numeri relativi alla revisione e alla build
ja: すべての値を指定するか、下に示すように '*' を使用してビルドおよびリビジョン番号を
ko: 모든 값을 지정하거나 아래와 같이 '*'를 사용하여 빌드 번호 및 수정 버전이 자동으로
ru: Можно задать все значения или принять номера сборки и редакции по умолчанию
zh_hans: 可以指定所有这些值，也可以使用“生成号”和“修订号”的默认值，
zh_hant: 您可以指定所有的值，也可以依照以下的方式，使用 '*' 將組建和修訂編號

# VersionInfo-Line3
source: by using the '*' as shown below:
es: mediante el carácter '*', como se muestra a continuación:
it: utilizzando l'asterisco (*) come illustrato di seguito:
ja: 既定値にすることができます。:
ko: 지정되도록 할 수 있습니다.:
ru: используя "*", как показано ниже:
zh_hans: 方法是按如下所示使用“*”: :
zh_hant: 指定為預設值: :
